MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS502/mcu.h
/* ADIEH */
#define _IE18 ADIEHbits.IE18
#define _IE19 ADIEHbits.IE19
#define _IE20 ADIEHbits.IE20
#define _IE21 ADIEHbits.IE21

/* ADSTATL */
#define _AN0RDY ADSTATLbits.AN0RDY
#define _AN1RDY ADSTATLbits.AN1RDY
#define _AN2RDY ADSTATLbits.AN2RDY
#define _AN3RDY ADSTATLbits.AN3RDY
#define _AN4RDY ADSTATLbits.AN4RDY
#define _AN5RDY ADSTATLbits.AN5RDY
#define _AN6RDY ADSTATLbits.AN6RDY
#define _AN7RDY ADSTATLbits.AN7RDY

/* ADSTATH */
#define _AN18RDY ADSTATHbits.AN18RDY
#define _AN19RDY ADSTATHbits.AN19RDY
#define _AN20RDY ADSTATHbits.AN20RDY
#define _AN21RDY ADSTATHbits.AN21RDY

/* ADCMP0ENL */
/* Bitname _CMPEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN1 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN2 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN3 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN4 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN5 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN6 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN7 cannot be defined because it is used by more than one SFR */

/* ADCMP0ENH */
/* Bitname _CMPEN18 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN19 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN20 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN21 cannot be defined because it is used by more than one SFR */

/* ADCMP1ENL */
/* Bitname _CMPEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN1 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN2 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN3 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN4 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN5 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN6 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN7 cannot be defined because it is used by more than one SFR */

/* ADCMP1ENH */
/* Bitname _CMPEN18 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN19 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN20 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN21 cannot be defined because it is used by more than one SFR */

/* ADFL0CON */
/* Bitname _FLCHSEL cannot be defined because it is used by more than one SFR */
/* Bitname _RDY cannot be defined because it is used by more than one SFR */
/* Bitname _IE cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM cannot be defined because it is used by more than one SFR */
/* Bitname _MODE cannot be defined because it is used by more than one SFR */
/* Bitname _FLEN cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL4 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM0 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM1 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM2 cannot be defined because it is used by more than one SFR */

/* ADFL1CON */
/* Bitname _FLCHSEL cannot be defined because it is used by more than one SFR */
/* Bitname _RDY cannot be defined because it is used by more than one SFR */
/* Bitname _IE cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM cannot be defined because it is used by more than one SFR */
/* Bitname _MODE cannot be defined because it is used by more than one SFR */
/* Bitname _FLEN cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL4 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM0 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM1 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM2 cannot be defined because it is used by more than one SFR */

/* ADTRIG0L */
#define _TRGSRC0 ADTRIG0Lbits.TRGSRC0
#define _TRGSRC1 ADTRIG0Lbits.TRGSRC1
#define _TRIGSRC00 ADTRIG0Lbits.TRIGSRC00
#define _TRIGSRC01 ADTRIG0Lbits.TRIGSRC01
#define _TRIGSRC02 ADTRIG0Lbits.TRIGSRC02
#define _TRIGSRC03 ADTRIG0Lbits.TRIGSRC03
#define _TRIGSRC04 ADTRIG0Lbits.TRIGSRC04
#define _TRGSRC10 ADTRIG0Lbits.TRGSRC10
#define _TRGSRC11 ADTRIG0Lbits.TRGSRC11
#define _TRGSRC12 ADTRIG0Lbits.TRGSRC12
#define _TRGSRC13 ADTRIG0Lbits.TRGSRC13
#define _TRGSRC14 ADTRIG0Lbits.TRGSRC14
#define _TRGSRC00 ADTRIG0Lbits.TRGSRC00
#define _TRGSRC01 ADTRIG0Lbits.TRGSRC01
#define _TRGSRC02 ADTRIG0Lbits.TRGSRC02
#define _TRGSRC03 ADTRIG0Lbits.TRGSRC03
#define _TRGSRC04 ADTRIG0Lbits.TRGSRC04

/* ADTRIG0H */
#define _TRGSRC2 ADTRIG0Hbits.TRGSRC2
#define _TRGSRC3 ADTRIG0Hbits.TRGSRC3
#define _TRIGSRC20 ADTRIG0Hbits.TRIGSRC20
#define _TRIGSRC21 ADTRIG0Hbits.TRIGSRC21
#define _TRIGSRC22 ADTRIG0Hbits.TRIGSRC22
#define _TRIGSRC23 ADTRIG0Hbits.TRIGSRC23
#define _TRIGSRC24 ADTRIG0Hbits.TRIGSRC24
#define _TRGSRC30 ADTRIG0Hbits.TRGSRC30
#define _TRGSRC31 ADTRIG0Hbits.TRGSRC31
#define _TRGSRC32 ADTRIG0Hbits.TRGSRC32
#define _TRGSRC33 ADTRIG0Hbits.TRGSRC33
#define _TRGSRC34 ADTRIG0Hbits.TRGSRC34
/* Bitname _TRGSRC20 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC21 cannot be defined because it is used by more than one SFR */
#define _TRGSRC22 ADTRIG0Hbits.TRGSRC22
#define _TRGSRC23 ADTRIG0Hbits.TRGSRC23
#define _TRGSRC24 ADTRIG0Hbits.TRGSRC24

/* ADTRIG1L */
#define _TRGSRC4 ADTRIG1Lbits.TRGSRC4
#define _TRGSRC5 ADTRIG1Lbits.TRGSRC5
#define _TRIGSRC40 ADTRIG1Lbits.TRIGSRC40
#define _TRIGSRC41 ADTRIG1Lbits.TRIGSRC41
#define _TRIGSRC42 ADTRIG1Lbits.TRIGSRC42
#define _TRIGSRC43 ADTRIG1Lbits.TRIGSRC43
#define _TRIGSRC44 ADTRIG1Lbits.TRIGSRC44
#define _TRGSRC50 ADTRIG1Lbits.TRGSRC50
#define _TRGSRC51 ADTRIG1Lbits.TRGSRC51
#define _TRGSRC52 ADTRIG1Lbits.TRGSRC52
#define _TRGSRC53 ADTRIG1Lbits.TRGSRC53
#define _TRGSRC54 ADTRIG1Lbits.TRGSRC54
#define _TRGSRC40 ADTRIG1Lbits.TRGSRC40
#define _TRGSRC41 ADTRIG1Lbits.TRGSRC41
#define _TRGSRC42 ADTRIG1Lbits.TRGSRC42
#define _TRGSRC43 ADTRIG1Lbits.TRGSRC43
#define _TRGSRC44 ADTRIG1Lbits.TRGSRC44

/* ADTRIG1H */
#define _TRGSRC6 ADTRIG1Hbits.TRGSRC6
#define _TRGSRC7 ADTRIG1Hbits.TRGSRC7
#define _TRIGSRC60 ADTRIG1Hbits.TRIGSRC60
#define _TRIGSRC61 ADTRIG1Hbits.TRIGSRC61
#define _TRIGSRC62 ADTRIG1Hbits.TRIGSRC62
#define _TRIGSRC63 ADTRIG1Hbits.TRIGSRC63
#define _TRIGSRC64 ADTRIG1Hbits.TRIGSRC64
#define _TRGSRC70 ADTRIG1Hbits.TRGSRC70
#define _TRGSRC71 ADTRIG1Hbits.TRGSRC71
#define _TRGSRC72 ADTRIG1Hbits.TRGSRC72
#define _TRGSRC73 ADTRIG1Hbits.TRGSRC73
#define _TRGSRC74 ADTRIG1Hbits.TRGSRC74
#define _TRGSRC60 ADTRIG1Hbits.TRGSRC60
#define _TRGSRC61 ADTRIG1Hbits.TRGSRC61
#define _TRGSRC62 ADTRIG1Hbits.TRGSRC62
#define _TRGSRC63 ADTRIG1Hbits.TRGSRC63
#define _TRGSRC64 ADTRIG1Hbits.TRGSRC64

/* ADTRIG4H */
#define _TRGSRC18 ADTRIG4Hbits.TRGSRC18
#define _TRGSRC19 ADTRIG4Hbits.TRGSRC19
#define _TRIGSRC180 ADTRIG4Hbits.TRIGSRC180
#define _TRIGSRC181 ADTRIG4Hbits.TRIGSRC181
#define _TRIGSRC182 ADTRIG4Hbits.TRIGSRC182
#define _TRIGSRC183 ADTRIG4Hbits.TRIGSRC183
#define _TRIGSRC184 ADTRIG4Hbits.TRIGSRC184
#define _TRGSRC190 ADTRIG4Hbits.TRGSRC190
#define _TRGSRC191 ADTRIG4Hbits.TRGSRC191
#define _TRGSRC192 ADTRIG4Hbits.TRGSRC192
#define _TRGSRC193 ADTRIG4Hbits.TRGSRC193
#define _TRGSRC194 ADTRIG4Hbits.TRGSRC194
#define _TRGSRC180 ADTRIG4Hbits.TRGSRC180
#define _TRGSRC181 ADTRIG4Hbits.TRGSRC181
#define _TRGSRC182 ADTRIG4Hbits.TRGSRC182
#define _TRGSRC183 ADTRIG4Hbits.TRGSRC183
#define _TRGSRC184 ADTRIG4Hbits.TRGSRC184

/* ADTRIG5L */
/* Bitname _TRGSRC20 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC21 cannot be defined because it is used by more than one SFR */
#define _TRIGSRC200 ADTRIG5Lbits.TRIGSRC200
#define _TRIGSRC201 ADTRIG5Lbits.TRIGSRC201
#define _TRIGSRC202 ADTRIG5Lbits.TRIGSRC202
#define _TRIGSRC203 ADTRIG5Lbits.TRIGSRC203
#define _TRIGSRC204 ADTRIG5Lbits.TRIGSRC204
#define _TRGSRC210 ADTRIG5Lbits.TRGSRC210
#define _TRGSRC211 ADTRIG5Lbits.TRGSRC211
#define _TRGSRC212 ADTRIG5Lbits.TRGSRC212
#define _TRGSRC213 ADTRIG5Lbits.TRGSRC213
#define _TRGSRC214 ADTRIG5Lbits.TRGSRC214
#define _TRGSRC200 ADTRIG5Lbits.TRGSRC200
#define _TRGSRC201 ADTRIG5Lbits.TRGSRC201
#define _TRGSRC202 ADTRIG5Lbits.TRGSRC202
#define _TRGSRC203 ADTRIG5Lbits.TRGSRC203
#define _TRGSRC204 ADTRIG5Lbits.TRGSRC204

/* ADCMP0CON */
/* Bitname _LOLO cannot be defined because it is used by more than one SFR */
/* Bitname _LOHI cannot be defined because it is used by more than one SFR */
/* Bitname _HILO cannot be defined because it is used by more than one SFR */
/* Bitname _HIHI cannot be defined because it is used by more than one SFR */
/* Bitname _BTWN cannot be defined because it is used by more than one SFR */
/* Bitname _STAT cannot be defined because it is used by more than one SFR */
/* Bitname _IE cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL0 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL1 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL2 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL3 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL4 cannot be defined because it is used by more than one SFR */

/* ADCMP1CON */
/* Bitname _LOLO cannot be defined because it is used by more than one SFR */
/* Bitname _LOHI cannot be defined because it is used by more than one SFR */
/* Bitname _HILO cannot be defined because it is used by more than one SFR */
/* Bitname _HIHI cannot be defined because it is used by more than one SFR */
/* Bitname _BTWN cannot be defined because it is used by more than one SFR */
/* Bitname _STAT cannot be defined because it is used by more than one SFR */
/* Bitname _IE cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL0 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL1 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL2 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL3 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL4 cannot be defined because it is used by more than one SFR */

/* ADLVLTRGL */
#define _LVLEN0 ADLVLTRGLbits.LVLEN0
#define _LVLEN1 ADLVLTRGLbits.LVLEN1
#define _LVLEN2 ADLVLTRGLbits.LVLEN2
#define _LVLEN3 ADLVLTRGLbits.LVLEN3
#define _LVLEN4 ADLVLTRGLbits.LVLEN4
#define _LVLEN5 ADLVLTRGLbits.LVLEN5
#define _LVLEN6 ADLVLTRGLbits.LVLEN6
#define _LVLEN7 ADLVLTRGLbits.LVLEN7

/* ADLVLTRGH */
#define _LVLEN18 ADLVLTRGHbits.LVLEN18
#define _LVLEN19 ADLVLTRGHbits.LVLEN19
#define _LVLEN20 ADLVLTRGHbits.LVLEN20
#define _LVLEN21 ADLVLTRGHbits.LVLEN21

/* ADCORE0L */
/* Bitname _SAMC cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC2 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC3 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC4 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC5 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC6 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC7 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC8 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC9 cannot be defined because it is used by more than one SFR */

