MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS502/mcu.h
#define _RPOR5_RP43R5_POSITION                   0x0000000D
#define _RPOR5_RP43R5_MASK                       0x00002000
#define _RPOR5_RP43R5_LENGTH                     0x00000001

#define _RPOR6_RP44R_POSITION                    0x00000000
#define _RPOR6_RP44R_MASK                        0x0000003F
#define _RPOR6_RP44R_LENGTH                      0x00000006

#define _RPOR6_RP45R_POSITION                    0x00000008
#define _RPOR6_RP45R_MASK                        0x00003F00
#define _RPOR6_RP45R_LENGTH                      0x00000006

#define _RPOR6_RP44R0_POSITION                   0x00000000
#define _RPOR6_RP44R0_MASK                       0x00000001
#define _RPOR6_RP44R0_LENGTH                     0x00000001

#define _RPOR6_RP44R1_POSITION                   0x00000001
#define _RPOR6_RP44R1_MASK                       0x00000002
#define _RPOR6_RP44R1_LENGTH                     0x00000001

#define _RPOR6_RP44R2_POSITION                   0x00000002
#define _RPOR6_RP44R2_MASK                       0x00000004
#define _RPOR6_RP44R2_LENGTH                     0x00000001

#define _RPOR6_RP44R3_POSITION                   0x00000003
#define _RPOR6_RP44R3_MASK                       0x00000008
#define _RPOR6_RP44R3_LENGTH                     0x00000001

#define _RPOR6_RP44R4_POSITION                   0x00000004
#define _RPOR6_RP44R4_MASK                       0x00000010
#define _RPOR6_RP44R4_LENGTH                     0x00000001

#define _RPOR6_RP44R5_POSITION                   0x00000005
#define _RPOR6_RP44R5_MASK                       0x00000020
#define _RPOR6_RP44R5_LENGTH                     0x00000001

#define _RPOR6_RP45R0_POSITION                   0x00000008
#define _RPOR6_RP45R0_MASK                       0x00000100
#define _RPOR6_RP45R0_LENGTH                     0x00000001

#define _RPOR6_RP45R1_POSITION                   0x00000009
#define _RPOR6_RP45R1_MASK                       0x00000200
#define _RPOR6_RP45R1_LENGTH                     0x00000001

#define _RPOR6_RP45R2_POSITION                   0x0000000A
#define _RPOR6_RP45R2_MASK                       0x00000400
#define _RPOR6_RP45R2_LENGTH                     0x00000001

#define _RPOR6_RP45R3_POSITION                   0x0000000B
#define _RPOR6_RP45R3_MASK                       0x00000800
#define _RPOR6_RP45R3_LENGTH                     0x00000001

#define _RPOR6_RP45R4_POSITION                   0x0000000C
#define _RPOR6_RP45R4_MASK                       0x00001000
#define _RPOR6_RP45R4_LENGTH                     0x00000001

#define _RPOR6_RP45R5_POSITION                   0x0000000D
#define _RPOR6_RP45R5_MASK                       0x00002000
#define _RPOR6_RP45R5_LENGTH                     0x00000001

#define _RPOR7_RP46R_POSITION                    0x00000000
#define _RPOR7_RP46R_MASK                        0x0000003F
#define _RPOR7_RP46R_LENGTH                      0x00000006

#define _RPOR7_RP47R_POSITION                    0x00000008
#define _RPOR7_RP47R_MASK                        0x00003F00
#define _RPOR7_RP47R_LENGTH                      0x00000006

#define _RPOR7_RP46R0_POSITION                   0x00000000
#define _RPOR7_RP46R0_MASK                       0x00000001
#define _RPOR7_RP46R0_LENGTH                     0x00000001

#define _RPOR7_RP46R1_POSITION                   0x00000001
#define _RPOR7_RP46R1_MASK                       0x00000002
#define _RPOR7_RP46R1_LENGTH                     0x00000001

#define _RPOR7_RP46R2_POSITION                   0x00000002
#define _RPOR7_RP46R2_MASK                       0x00000004
#define _RPOR7_RP46R2_LENGTH                     0x00000001

#define _RPOR7_RP46R3_POSITION                   0x00000003
#define _RPOR7_RP46R3_MASK                       0x00000008
#define _RPOR7_RP46R3_LENGTH                     0x00000001

#define _RPOR7_RP46R4_POSITION                   0x00000004
#define _RPOR7_RP46R4_MASK                       0x00000010
#define _RPOR7_RP46R4_LENGTH                     0x00000001

#define _RPOR7_RP46R5_POSITION                   0x00000005
#define _RPOR7_RP46R5_MASK                       0x00000020
#define _RPOR7_RP46R5_LENGTH                     0x00000001

#define _RPOR7_RP47R0_POSITION                   0x00000008
#define _RPOR7_RP47R0_MASK                       0x00000100
#define _RPOR7_RP47R0_LENGTH                     0x00000001

#define _RPOR7_RP47R1_POSITION                   0x00000009
#define _RPOR7_RP47R1_MASK                       0x00000200
#define _RPOR7_RP47R1_LENGTH                     0x00000001

#define _RPOR7_RP47R2_POSITION                   0x0000000A
#define _RPOR7_RP47R2_MASK                       0x00000400
#define _RPOR7_RP47R2_LENGTH                     0x00000001

#define _RPOR7_RP47R3_POSITION                   0x0000000B
#define _RPOR7_RP47R3_MASK                       0x00000800
#define _RPOR7_RP47R3_LENGTH                     0x00000001

#define _RPOR7_RP47R4_POSITION                   0x0000000C
#define _RPOR7_RP47R4_MASK                       0x00001000
#define _RPOR7_RP47R4_LENGTH                     0x00000001

#define _RPOR7_RP47R5_POSITION                   0x0000000D
#define _RPOR7_RP47R5_MASK                       0x00002000
#define _RPOR7_RP47R5_LENGTH                     0x00000001

#define _RPOR16_RP176R_POSITION                  0x00000000
#define _RPOR16_RP176R_MASK                      0x0000003F
#define _RPOR16_RP176R_LENGTH                    0x00000006

#define _RPOR16_RP177R_POSITION                  0x00000008
#define _RPOR16_RP177R_MASK                      0x00003F00
#define _RPOR16_RP177R_LENGTH                    0x00000006

#define _RPOR16_RP176R0_POSITION                 0x00000000
#define _RPOR16_RP176R0_MASK                     0x00000001
#define _RPOR16_RP176R0_LENGTH                   0x00000001

#define _RPOR16_RP176R1_POSITION                 0x00000001
#define _RPOR16_RP176R1_MASK                     0x00000002
#define _RPOR16_RP176R1_LENGTH                   0x00000001

#define _RPOR16_RP176R2_POSITION                 0x00000002
#define _RPOR16_RP176R2_MASK                     0x00000004
#define _RPOR16_RP176R2_LENGTH                   0x00000001

#define _RPOR16_RP176R3_POSITION                 0x00000003
#define _RPOR16_RP176R3_MASK                     0x00000008
#define _RPOR16_RP176R3_LENGTH                   0x00000001

#define _RPOR16_RP176R4_POSITION                 0x00000004
#define _RPOR16_RP176R4_MASK                     0x00000010
#define _RPOR16_RP176R4_LENGTH                   0x00000001

#define _RPOR16_RP176R5_POSITION                 0x00000005
#define _RPOR16_RP176R5_MASK                     0x00000020
#define _RPOR16_RP176R5_LENGTH                   0x00000001

#define _RPOR16_RP177R0_POSITION                 0x00000008
#define _RPOR16_RP177R0_MASK                     0x00000100
#define _RPOR16_RP177R0_LENGTH                   0x00000001

#define _RPOR16_RP177R1_POSITION                 0x00000009
#define _RPOR16_RP177R1_MASK                     0x00000200
#define _RPOR16_RP177R1_LENGTH                   0x00000001

